app/views/users/done.html.erb

      <% @dones.each do |done| %>
        <% performance = Performance.find_by(id: done.performance_id) %>
---
SELECT  "performances".* FROM "performances" WHERE "performances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]