app/views/users/wanna.html.erb

SELECT  "performances".* FROM "performances" WHERE "performances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% @wannas.each do |wanna| %>
      <% performance = Performance.find_by(id: wanna.performance_id) %>