app/controllers/dones_controller.rb

  def create
    @done = Done.new(user_id:@current_user.id, performance_id:params[:performance_id])
    @done.save
---
INSERT INTO "dones" ("performance_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["performance_id", 1], ["user_id", 1], ["created_at", "2019-11-19 14:35:49.609135"], ["updated_at", "2019-11-19 14:35:49.609135"]]

  def destroy
    @done = Done.find_by(user_id:@current_user.id, performance_id:params[:performance_id])
    @done.destroy
---
SELECT  "dones".* FROM "dones" WHERE "dones"."user_id" = ? AND "dones"."performance_id" = ? LIMIT ?  [["user_id", 1], ["performance_id", 1], ["LIMIT", 1]]
DELETE FROM "dones" WHERE "dones"."id" = ?  [["id", 2]]