app/controllers/performances_controller.rb

SELECT "performances".* FROM "performances"
---
  def index
    @performances = Performance.all

SELECT  "performances".* FROM "performances" WHERE "performances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @performance = Performance.find_by(id: params[:id])