app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def new
    @post = Post.new
    @performances = Performance.all
---
SELECT "performances".* FROM "performances"

  def create
    @post = Post.new(content: params[:content], user_id: @current_user.id, performance_id: params[:performance_id])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "performance_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "めちゃめちゃ面白かった！！"], ["created_at", "2019-12-18 14:25:38.395357"], ["updated_at", "2019-12-18 14:25:38.395357"], ["performance_id", 2], ["user_id", 1]]

  def show
    @post = Post.find_by(id: params[:id])
    @user = @post.user
    @performance = Performance.find_by(id: @post.performance_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "performances".* FROM "performances" WHERE "performances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @post = Post.find_by(id: params[:id])
    @performances = Performance.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "performances".* FROM "performances"

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "日本語にならねえなんでだ"], ["updated_at", "2019-11-16 02:15:58.213018"], ["id", 6]]

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]