app/controllers/posts_controller.rb

  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]