app/controllers/users_controller.rb

  def login
    @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gucci@gmail.com"], ["LIMIT", 1]]

  def create
    @user = User.new(
                      name: params[:name],
                      email: params[:email],
                      password:params[:password]
                    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "yamaguchi"], ["email", "yamaguchi@gmail.com"], ["created_at", "2019-11-17 10:06:59.421124"], ["updated_at", "2019-11-17 10:06:59.421124"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "1.jpg"], ["updated_at", "2019-11-17 11:28:34.672467"], ["id", 1]]

  def done
    @user = User.find_by(id: params[:id])
    @dones = Done.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "dones".* FROM "dones" WHERE "dones"."user_id" = ?  [["user_id", 1]]

  def wanna
    @user = User.find_by(id: params[:id])
    @wannas = Wanna.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "wannas".* FROM "wannas" WHERE "wannas"."user_id" = ?  [["user_id", 1]]