app/controllers/wannas_controller.rb

INSERT INTO "wannas" ("performance_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["performance_id", 1], ["user_id", 1], ["created_at", "2019-11-19 14:35:51.649010"], ["updated_at", "2019-11-19 14:35:51.649010"]]
---
  def create
    @wanna = Wanna.new(user_id:@current_user.id, performance_id:params[:performance_id])
    @wanna.save

SELECT  "wannas".* FROM "wannas" WHERE "wannas"."user_id" = ? AND "wannas"."performance_id" = ? LIMIT ?  [["user_id", 1], ["performance_id", 1], ["LIMIT", 1]]
DELETE FROM "wannas" WHERE "wannas"."id" = ?  [["id", 2]]
---
  def destroy
    @wanna = Wanna.find_by(user_id:@current_user.id, performance_id:params[:performance_id])
    @wanna.destroy