app/views/performances/show.html.erb

      </p>
      <% if Done.find_by(user_id:@current_user.id, performance_id:@performance.id) %>
---
SELECT  "dones".* FROM "dones" WHERE "dones"."user_id" = ? AND "dones"."performance_id" = ? LIMIT ?  [["user_id", 1], ["performance_id", 1], ["LIMIT", 1]]

      <% end %>
      <% if Wanna.find_by(user_id:@current_user.id, performance_id:@performance.id) %>
---
SELECT  "wannas".* FROM "wannas" WHERE "wannas"."user_id" = ? AND "wannas"."performance_id" = ? LIMIT ?  [["user_id", 1], ["performance_id", 1], ["LIMIT", 1]]

    </div>
    <% @performance.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."performance_id" = ?  [["performance_id", 1]]